massive update from testing to readme and other bug which got resolved and also implemented the delete the account thing
